/*==============================================================*/
/* DBMS name:      Microsoft SQL Server 2016                    */
/* Created on:     20.10.2020 14:00:54                          */
/*==============================================================*/


/*==============================================================*/
/* Table: "желчный пузырь"                                      */
/*==============================================================*/
create table "желчный пузырь" (
   "номер исследования желчного пузыря" bigint   IDENTITY(1,1)    not null,
   "форма"                text                 null,
   "размеры жп"         text                 null,
   "стенки"               text                 null,
   "стенки значение"    int                  null,
   "внутрипросветные образования" text                 null,
   "имеют акустическую ткань" text                 null,
   "смещаются"            text                 null,
   constraint "PK_ЖЕЛЧНЫЙ ПУЗЫРЬ" primary key ("номер исследования желчного пузыря")
)
go

/*==============================================================*/
/* Table: "желчные протоки"                                     */
/*==============================================================*/
create table "желчные протоки" (
   "номер исследования желчных протоков" bigint		IDENTITY(1,1)	not null,
   "общий желчный проток размер" int                  null,
   "общий желчный проток пояснение" text                 null,
   "внутрипеченочные желчные протоки" text                 null,
   "дополнительные образования" text                 null,
   constraint "PK_ЖЕЛЧНЫЕ ПРОТОКИ" primary key ("номер исследования желчных протоков")
)
go

/*==============================================================*/
/* Table: пациент                                               */
/*==============================================================*/
create table "пациент" (
   "айди пациента"      bigint		IDENTITY(1,1)	not null,
   "фамилия"              text                 not null,
   "имя"                  text                 not null,
   "отчество"             text                 null,
   "номер мед карты"	  text                 null,
   constraint PK_ПАЦИЕНТ primary key ("айди пациента")
)
go

/*==============================================================*/
/* Table: печень                                                */
/*==============================================================*/
create table "печень" (
   "номер исследования печени" bigint		IDENTITY(1,1)	not null,
   "доступ"               text                 null,
   "размеры печени"     text                 null,
   "квр"                  int                  null,
   "ккр правой доли"    int                  null,
   "ккр левой доли"     int                  null,
   "пзр правой доли"    int                  null,
   "пзр левой доли"     int                  null,
   "хвостатая доля"     int                  null,
   "толщина хд к лд"    int                  null,
   "контуры"              text                 null,
   "капсула"              text                 null,
   "эхоструктура паренхимы" text                 null,
   "эхогенность паренхимы" text                 null,
   "очаговые образования" text                 null,
   "воротная вена"      int                  null,
   "печеночные вены"    int                  null,
   "сосудистый рисунок" text                 null,
   "нижняя полая вена"  text                 null,
   "нижняя полая вена размер" int                  null,
   constraint PK_ПЕЧЕНЬ primary key ("номер исследования печени")
)
go

/*==============================================================*/
/* Table: "поджелудочная железа"                                */
/*==============================================================*/
create table "поджелудочная железа" (
   "номер исследования поджелудочной железы" bigint 		IDENTITY(1,1)	not null,
   "головка"              int                  null,
   "тело"                 int                  null,
   "хвост"                int                  null,
   "размеры поджелудочной железы" text                 null,
   constraint "PK_ПОДЖЕЛУДОЧНАЯ ЖЕЛЕЗА" primary key ("номер исследования поджелудочной железы")
)
go

/*==============================================================*/
/* Table: "узи брюшной полости"                                 */
/*==============================================================*/
create table "узи брюшной полости" (
   "номер исследования печени" bigint 		IDENTITY(1,1)	not null,
   "номер исследования желчных протоков" bigint               not null,
   "номер исследования желчного пузыря" bigint               not null,
   "номер исследования поджелудочной железы" bigint               not null,
   "айди пациента"      bigint               not null,
   "номер узи брюшной полости" bigint               not null,
   "дата узи брюшной полости" datetime             null,
   "время узи брюшной полости" datetime             null,
   "дата и время узибп" datetime             null,
   constraint "PK_УЗИ БРЮШНОЙ ПОЛОСТИ" primary key ("номер исследования печени", "номер исследования желчных протоков", "номер исследования желчного пузыря", "номер исследования поджелудочной железы", "айди пациента", "номер узи брюшной полости")
)
go

/*==============================================================*/
/* Index: Relationship_1_FK                                     */
/*==============================================================*/




create nonclustered index Relationship_1_FK on "узи брюшной полости" ("номер исследования печени" ASC)
go

/*==============================================================*/
/* Index: Relationship_2_FK                                     */
/*==============================================================*/




create nonclustered index Relationship_2_FK on "узи брюшной полости" ("номер исследования желчных протоков" ASC)
go

/*==============================================================*/
/* Index: Relationship_3_FK                                     */
/*==============================================================*/




create nonclustered index Relationship_3_FK on "узи брюшной полости" ("номер исследования желчного пузыря" ASC)
go

/*==============================================================*/
/* Index: Relationship_4_FK                                     */
/*==============================================================*/




create nonclustered index Relationship_4_FK on "узи брюшной полости" ("номер исследования поджелудочной железы" ASC)
go

/*==============================================================*/
/* Index: Relationship_5_FK                                     */
/*==============================================================*/




create nonclustered index Relationship_5_FK on "узи брюшной полости" ("айди пациента" ASC)
go

/*==============================================================*/
/* Table: "узи почек"                                           */
/*==============================================================*/
create table "узи почек" (
   "айди пациента"      bigint               not null,
   "номер исследования узи почек" bigint 		IDENTITY(1,1)	not null,
   constraint "PK_УЗИ ПОЧЕК" primary key ("айди пациента")
)
go

alter table "узи брюшной полости"
   add constraint "FK_УЗИ БРЮШ_RELATIONS_ПЕЧЕНЬ" foreign key ("номер исследования печени")
      references "печень" ("номер исследования печени")
go

alter table "узи брюшной полости"
   add constraint "FK_УЗИ БРЮШ_RELATIONS_ЖЕЛЧНЫЕ" foreign key ("номер исследования желчных протоков")
      references "желчные протоки" ("номер исследования желчных протоков")
go

alter table "узи брюшной полости"
   add constraint "FK_УЗИ БРЮШ_RELATIONS_ЖЕЛЧНЫЙ" foreign key ("номер исследования желчного пузыря")
      references "желчный пузырь" ("номер исследования желчного пузыря")
go

alter table "узи брюшной полости"
   add constraint "FK_УЗИ БРЮШ_RELATIONS_ПОДЖЕЛУД" foreign key ("номер исследования поджелудочной железы")
      references "поджелудочная железа" ("номер исследования поджелудочной железы")
go

alter table "узи брюшной полости"
   add constraint "FK_УЗИ БРЮШ_RELATIONS_ПАЦИЕНТ" foreign key ("айди пациента")
      references "пациент" ("айди пациента")
go

alter table "узи почек"
   add constraint "FK_УЗИ ПОЧЕ_RELATIONS_ПАЦИЕНТ" foreign key ("айди пациента")
      references "пациент" ("айди пациента")
go

